Tekla.Structures.Drawing.Events.DrawingUpdateTypeEnum
The types of drawing update event.

Tekla.Structures.Drawing.Events.DrawingUpdateTypeEnum.INSERTED
Drawing created

Tekla.Structures.Drawing.Events.DrawingUpdateTypeEnum.MODIFIED
Drawing modified

Tekla.Structures.Drawing.Events.DrawingUpdateTypeEnum.DELETED
Drawing deleted